<a href="https://colab.research.google.com/github/2303a51043/Batch1_PFDS_1043/blob/main/Untitled15.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [8]:
import pandas as pd
import numpy as np

data = {
    'Name': ['Ravi', 'Neha', 'Kiran', 'Sita'],
    'Age': [25, np.nan, 30, 28],
    'Marks': [85, 90, np.nan, 92]
}

df = pd.DataFrame(data)

print("Original DataFrame")
print(df)

print("\nCheck for Missing values")
print(df.isnull())

Original DataFrame
    Name   Age  Marks
0   Ravi  25.0   85.0
1   Neha   NaN   90.0
2  Kiran  30.0    NaN
3   Sita  28.0   92.0

Check for Missing values
    Name    Age  Marks
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False

In [10]:
# dropping
df_dropped = df.dropna()
print("After Dropping Rows with NaN")
print(df_dropped)

After Dropping Rows with NaN
   Name   Age  Marks
0  Ravi  25.0   85.0
3  Sita  28.0   92.0

In [14]:
# Fill Missing Values with 0
df_filled = df.fillna(0)
print("Filled with 0")
print(df_filled)

Filled with 0
    Name        Age  Marks
0   Ravi  25.000000   85.0
1   Neha  27.666667   90.0
2  Kiran  30.000000   89.0
3   Sita  28.000000   92.0

In [16]:
df['Age']=df['Age'].fillna(df['Age'].mean())
df['Marks']=df['Marks'].fillna(df['Marks'].mean())
print(df)

    Name        Age  Marks
0   Ravi  25.000000   85.0
1   Neha  27.666667   90.0
2  Kiran  30.000000   89.0
3   Sita  28.000000   92.0

In [18]:
import pandas as pd

# Handling duplicates
data = {
    'ID': [1, 2, 2, 3, 4, 4],
    'Name': ['Ravi', 'Neha', 'Kiran', 'Sita', 'Amit', 'Raj'],  # 6 names added
    'Marks': [85, 90, 90, 92, 23, 26]
}

# Create DataFrame
df = pd.DataFrame(data)

print("Original DataFrame with duplicates:")
print(df)

# Remove duplicate rows
df_no_duplicates = df.drop_duplicates()
print("\nDataFrame after removing duplicates:")
print(df_no_duplicates)

Original DataFrame with duplicates:
   ID   Name  Marks
0   1   Ravi     85
1   2   Neha     90
2   2  Kiran     90
3   3   Sita     92
4   4   Amit     23
5   4    Raj     26

DataFrame after removing duplicates:
   ID   Name  Marks
0   1   Ravi     85
1   2   Neha     90
2   2  Kiran     90
3   3   Sita     92
4   4   Amit     23
5   4    Raj     26

In [20]:
#remove duplicates
df_no_duplicates=df.drop_duplicates()
print("dataframe without duplicates")
print(df_no_duplicates)

dataframe without duplicates
   ID   Name  Marks
0   1   Ravi     85
1   2   Neha     90
2   2  Kiran     90
3   3   Sita     92
4   4   Amit     23
5   4    Raj     26

In [25]:
#changing the data types
data = {
           'ID':['1','2','3','4'],
           'Marks':['85','90','78','92']
       }
df=pd.DataFrame(data)
print("Original DataFrame")
print(df.dtypes)

Original DataFrame
ID       object
Marks    object
dtype: object

In [28]:
#applying transformations
df['Marks']=df['Marks'].astype(int)
df['Marks']=df['Marks'].apply(lambda x :x+5)
print("After adding Bonus Marks")
print(df)

After adding Bonus Marks
  ID  Marks
0  1     90
1  2     95
2  3     83
3  4     97

In [31]:
#normilazation of marks
df['Marks_normalized']=(df['Marks']-df['Marks'].min())/(df['Marks'].max()-df['Marks'].min())
print("After normalization")
print(df)

After normalization
  ID  Marks  Marks_normalized
0  1     90          0.500000
1  2     95          0.857143
2  3     83          0.000000
3  4     97          1.000000